# ประกาศตัวแปรชื่อว่า user_name ให้เก็บ String คำว่า:
# โค้ดคิท

# และประกาศตัวแปรอีกตัวชื่อว่า course เก็บ String คำว่า:
# python

# ตามลำดับ

# ลองแสดงผลตัวแปร user_name และตัวแปร course (คนละบรรทัด และตามลำดับ) ดู

# user_name = "โค้ดคิท"d

# course = "python"

# print(user_name)
# print(course)

a = 33
# ถ้า a เป็น integer อยู่ในช่วงตั้งแต่ 30 ถึง 50 (รวม 30 และ 50 ด้วย) ให้ print 'a อยู่ในช่วงตั้งแต่ 30 ถึง 50'
if a>=30 and a<=50:
    print("a อยู่ในช่วงตั้งแต่ 30 ถึง 50")

b = 79
# ถ้า b น้อยกว่า 30 หรือมากกว่า 50, print 'b น้อยกว่า 30 หรือมากกว่า 50'
if b<30 or b>50:
    print("b น้อยกว่า 30 หรือมากกว่า 50")

c = 55
# ถ้า c ไม่เท่ากับ 88 (ใช้ not คู่กับ == ไม่ใช่ !=), print 'c ไม่เท่ากับ 8
if c!=88:
    print('c ไม่เท่ากับ 88')