a concept,แนวคิด
a context,บริบท
a part,ห่างกัน
a part of,ส่วนหนึ่งของ
abbraviate,กอด
abbrecai,ทำแท้ง
abbreviate,ย่อ
abduct,การลักพาตัว
abolish,ยกเลิก
abortion,การทำแท้ง
absorb,ดูดซับ
abstain,งดเว้น
abstract,เชิงนามธรรม
abuse,ใช้ในทางที่ผิด
accelerate,เร่งความเร็ว
accent,สำเนียง
access rights,สิทธิ์ในการเข้าถึง
accident,อุบัติเหตุ
accuse,กล่าวโทษ
actual,แท้จริง
acute,เฉียบพลัน
addicted,ติดยาเสพติด
address,ที่อยู่
adhere,ยึดติด
adjacent,ใกล้เคียง
admirable,น่าชื่นชม
adorable,น่ารัก
adore,รัก
advice,คำแนะนำ
advise,ให้คำแนะนำ
advocates,ผู้สนับสนุน
aerial,ทางอากาศ
aesthetic,เกี่ยวกับความงาม
afddasfdaf,เหลือเชื่อ
affair,ธุระ
aggressive,ก้าวร้าว
aid,การช่วยเหลือ
air filter,ตัวกรองอากาศ
align,จัดแนว
aliment,การเสริมกำลัง
allergic,แพ้
alleviate,บรรเทา
alternative,ทางเลือก
ambigo,ทำให้เบาบางลง
amends,แก้ไข
analogous,คล้ายคลึงกัน
analogy,การเปรียบเทียบ
analysis,การวิเคราะห์
announce,ประกาศ
answer,คำตอบ
answer paper,ตอบกระดาษ
answer sheet,แผ่นคำตอบ
anticipated,ที่คาดไว้
anxiety,ความวิตกกังวล
apart,ห่างกัน
applause,เสียงปรบมือ
approach,เข้าใกล้
approaches,วิธีการ
appropriate,เหมาะสม
appropriately,เหมาะสม
approval,การอนุมัติ
aptitude,ความถนัด
architect,สถาปนิก
archive,คลังเก็บเอกสารสำคัญ
armed,ติดอาวุธ
arouse,กระตุ้น
ash,เถ้า
aside,นอกเหนือจาก
aspects,แง่มุม
aspiration,ความทะเยอทะยาน
ass,ตูด
assist,ช่วยเหลือ
attached,ที่แนบมา
attitude,ทัศนคติ
attract,ดึงดูด
attractive,มีเสน่ห์
attribute,คุณลักษณะ
attributes,คุณลักษณะ
authentication,การรับรองความถูกต้อง
authenticity,ความถูกต้อง
avalanche,หิมะถล่ม
average,เฉลี่ย
awe,ความกลัว
awful,แย่มาก
bare,เปลือย
bastard,ไอ้
bathroom,ห้องน้ำ
beautiful,สวย
before,ก่อน
bent,งอ
bland,อ่อนโยน
blasted,เสียหาย
bless you,อวยพรคุณ
blessed,มีความสุข
blind,ตาบอด
blood vessel,เส้นเลือด
blow,เป่า
bold,ตัวหนา
border,ชายแดน
bound,ผูกพัน
brace,รั้ง
branch,สาขา
brand pain,อาการปวดตราสินค้า
brass,ทองเหลือง
brat,เด็กเหลือขอ
breadth,ความกว้าง
bribe,สินบน
bride,เจ้าสาว
brief,รวบรัด
broader,กว้างขึ้น
brutal,โหดร้าย
bull,วัว
bundle,มัด
buoyant,ลอยตัว
burglar,ขโมย
bush,พุ่มไม้
bushwacker,ผู้เดินป่า
businessperson,นักธุรกิจ
button,ปุ่ม
by air,ทางอากาศ
camouflage,การพรางตัว
cannibalism,การกินเนื้อสัตว์
cannot sleep,นอนไม่หลับ
canvas,ผ้าใบ
capable,มีความสามารถ
car,รถ
casual,ไม่เป็นทางการ
casualty,ผู้เสียชีวิต
cat,แมว
category,หมวดหมู่
caterpillar,หนอน
catnip,หญ้าชนิดหนึ่ง
causal,เป็นสาเหตุ
cease,หยุด
celebrate,ฉลอง
ceremony,พิธี
certain,แน่ใจ
charging cable,สายชาร์จ
charisma,ความสามารถพิเศษ
charismatic,มีเสน่ห์
cheek,แก้ม
chill,เย็น
circuit,วงจร
cite,อ้างถึง
climate,ภูมิอากาศ
clock,นาฬิกา
closet,ตู้เสื้อผ้า
clutch,คลัตช์
cognitive,เกี่ยวกับความรู้ความเข้าใจ
coin,เหรียญ
coincidence,เหตุบังเอิญ
colleagues,เพื่อนร่วมงาน
collision,การชนกัน
column,คอลัมน์
come to trial,มาทดลองใช้
commit,ให้สัญญา
commitment,ความมุ่งมั่น
community,ชุมชน
compassion,ความเมตตากรุณา
competent,มีอำนาจ
complement,ส่วนประกอบ
compliment,ชมเชย
compose,แต่งเพลง
compound,สารประกอบ
comprehension,ความเข้าใจ
comprehensive,ครอบคลุม
comrade,สหาย
concave,เว้า
concern,กังวล
concerned,น่ากังวล
conclusion,บทสรุป
condensed,ย่อ
condition,เงื่อนไข
confused,สับสน
conqueror,ผู้พิชิต
consecutive,ติดต่อกัน
consensus,ฉันทามติ
conservative,ซึ่งอนุรักษ์นิยม
considerate,มีน้ำใจ
consistent,สม่ำเสมอ
consonants,พยัญชนะ
constraintss,ข้อ จำกัด
contaminated,ที่ปนเปื้อน
contiguous,ติดกัน
contradictory,ขัดแย้ง
contrast colors,สีตัดกัน
contribute,มีส่วนช่วย
contributed,มีส่วนร่วม
controversial,เป็นที่ถกเถียง
conventional wisdom,ภูมิปัญญาดั้งเดิม
converse,สนทนา
cooperate,ร่วมมือ
copy,สำเนา
corrupted,ทำให้เสียหาย
cost,ค่าใช้จ่าย
council,สภา
country,ประเทศ
cover,ปิดบัง
creak,เสียงดังเอี๊ยด
crest,ยอด
crew,ลูกทีม
cringe,หดหนี
crisis,วิกฤติ
criteria,เกณฑ์
criterion,เกณฑ์
cruel,โหดร้าย
crush,บดขยี้
crushing,การบดขยี้
cumbersome,ยุ่งยาก
cure,รักษา
cured,หาย
curiosity,ความอยากรู้
curtain,ม่าน
dandruff,รังแค
danduff,รังแก
debate,อภิปราย
debt,หนี้
deceive,หลอกลวง
decent,เหมาะสม
decorate,ตกแต่ง
decrypt,ถอดรหัส
dedicate,อุทิศ
deem,เห็นว่า
default,ค่าเริ่มต้น
deficit,การขาดดุล
deliberate,ไตร่ตรอง
delicate,ละเอียดอ่อน
delight,ความสุขใจ
demonstrated,ซึ่งแสดงให้เห็น
denial,การปฏิเสธ
denote,หมายถึง
dense,หนาแน่น
deprivation,การกีดกัน
derivatives,อนุพันธ์
desired,เป็นที่ต้องการ
despair,สิ้นหวัง
detach,รายละเอียด
deteriorating,ซึ่งเสื่อมโทรม
determined,มุ่งมั่น
developer,ผู้พัฒนา
deviation,การเบี่ยงเบน
devour,กลืน
diabolical,ไม่สม่ำเสมอ
diagnose,วินิจฉัย
diaphragm,กะบังลม
differ,แตกต่าง
digit,ตัวเลขหลัก
diminish,ลดน้อยลง
discard,ทิ้ง
discipline,การลงโทษ
dislocate,แยกออกจากกัน
disruption,การหยุดชะงัก
distinct,แตกต่าง
distinguish,แยกแยะ
distribution,การกระจาย
district,เขต
ditch,คูน้ำ
diverse,มีความหลากหลาย
dog,สุนัข
domestic,ภายในประเทศ
dominant,ที่เด่น
dominate,ครอบงำ
door knob,ลูกบิดประตู
doorknob,ลูกบิดประตู
draft,ร่าง
dream,ฝัน
dream partner,หุ้นส่วนในฝัน
drop,หยด
drop something,วางบางสิ่งบางอย่าง
due,เนื่องจาก
dull,น่าเบื่อ
dyed hair,ผมย้อม
eager,กระตือรือร้น
elaborate,ขยายความ
elation,ความอิ่มเอมใจ
electric shock,ไฟฟ้าช็อต
elegant,สง่างาม
ellipse,วงรี
embarrassed,เขินอาย
embarrassing,น่าอาย
embrace,โอบกอด
emerge,เกิดขึ้น
emigrate,อพยพ
empathy,ความเข้าอกเข้าใจ
emphasize,เน้นย้ำ
empower,มอบอำนาจ
encourage,ให้กำลังใจ
encryption,การเข้ารหัส
end,จบ
engage,หมั้น
engagement,การว่าจ้าง
enhance,ยกระดับ
ensure,ทำให้มั่นใจ
enter the country,เข้าประเทศ
entertainment,ความบันเทิง
entire,ทั้งหมด
epicenter,ศูนย์กลาง
epoch,ยุค
essentialism,ความสำคัญ
establish,สร้าง
esteem,ความนับถือ
eternity,นิรันดร์
ethics,จริยธรรม
ethincity,เชื้อชาติ
ethnicity,เชื้อชาติ
exaggerate,พูดเกินจริง
exceed,เกิน
exciting,น่าตื่นเต้น
exclusive,พิเศษ
executed,ประหารชีวิต
exploit,ใช้ประโยชน์
extract,สารสกัด
extracted,สกัด
extravagant,ฟุ่มเฟือย
faculty,คณะ
fade,จางลง
faint,เป็นลม
faith,ศรัทธา
fall asleep,หลับไป
false,เท็จ
fascinating,น่าหลงใหล
fatigue,ความเหนื่อยล้า
favor,ความโปรดปราน
feast,งานเลี้ยง
feature,คุณสมบัติ
fertile,อุดมสมบูรณ์
figure,รูป
find information,ค้นหาข้อมูล
fitting,การพอดี
flaw,ข้อบกพร่อง
flex,งอ
flick,สะบัด
float,ลอย
flush,ฟลัช
fold,พับ
forensic,นิวเคลียส
fort,ป้อมปราการ
foul,เหม็น
foundation,พื้นฐาน
frame,กรอบ
framework,กรอบ
from,จาก
frustrate,ทำลาย
fulfill,เติมเต็ม
funny,ตลก
fuss,เอะอะ
gain,ได้รับ
gambling,การพนัน
gather,รวมตัว
gekkos,คลั่งไคล้
genius,อัจฉริยะ
gentle,อ่อนโยน
genuine,แท้จริง
gesture,ท่าทาง
gibsonize,ทำให้เสียโฉม
give up,ยอมแพ้
global,ทั่วโลก
gorgeous,งดงาม
grain,ข้าว
grapefruit,ส้มโอ
grasp,เข้าใจ
gratificai,มีความสุข
greedy,โลภ
green,สีเขียว
green pepper,พริกเขียว
grieve,เสียใจ
group,กลุ่ม
gullible,ใจง่าย
gurgle,กระวนกระวายใจ
gut,ลำไส้
habitat,ที่อยู่อาศัย
handicapping,แต้มต่อ
hapazardly,ส่งเดช
haphazard,จับจด
harsh,รุนแรง
harvesting,การเก็บเกี่ยว
hat off,ปิดหมวก
hazardous,เป็นอันตราย
healthy,สุขภาพดี
height,ความสูง
hence,เพราะฉะนั้น
hesitate,ลังเล
hey,เฮ้
hierarchical,เกี่ยวกับลำดับชั้น
hierarchy,ลำดับชั้น
hiss,ฟ่อ
hold,ถือ
honest,ซื่อสัตย์
hopelessness,ความสิ้นหวัง
hos,กับ
hospitable,ใจดี
hospitality,การต้อนรับ
host,เจ้าภาพ
hostile,เป็นศัตรูกัน
howling,เสียงโหยหวน
humor,อารมณ์ขัน
hunched,เลี้ยว
ideal,ในอุดมคติ
idiot,งี่เง่า
immature,ยังไม่บรรลุนิติภาวะ
immigration,การตรวจคนเข้าเมือง
immigrte,อพยพ
impressed,น่าสยดสยอง
impressive,ประทับใจ
impulse,แรงกระตุ้น
in spite,ทั้งๆ
in the,ใน
incident,เหตุการณ์
include,รวม
inclusive,ซึ่งครอบคลุม
incorporate,รวม
independent,เป็นอิสระ
indicate,ระบุ
indigo,คราม
indulgent,ตามใจ
industry,อุตสาหกรรม
inevitable,หลีกเลี่ยงไม่ได้
influence,อิทธิพล
information data,ข้อมูลข้อมูล
inhabit,อาศัยอยู่
inheritance,มรดก
injury,บาดเจ็บ
innambiguous,มีน้ำใจ
insomnia,นอนไม่หลับ
inspect,ตรวจสอบ
instance,ตัวอย่าง
institute,สถาบัน
institution,สถาบัน
integration,การรวมเข้าด้วยกัน
intensity,ความรุนแรง
intention,เจตนา
interfere,รบกวน
intermittent,ไม่สม่ำเสมอ
interpersonal,ระหว่างบุคคล
intervention,การแทรกแซง
intestine,ลำไส้
intriguing,ที่น่าสนใจ
intrusion,การบุกรุก
intuition,ปรีชา
invasion,การบุกรุก
invention,สิ่งประดิษฐ์
involve,มีส่วนร่วม
irony,ประชดประชัน
ivory,งาช้าง
jaw,กราม
jawbone,กระดูกขากรรไกร
jeopardy,อันตราย
junior,จูเนียร์
kidney,ไต
kill off,ฆ่า
kizuki,คิซึกิ
knuckles,นิ้ว
koiiro,สีเข้ม
landscape,ภูมิประเทศ
language,ภาษา
lawn,สนามหญ้า
leased,ให้เช่า
legend,ตำนาน
leisure,เวลาว่าง
length width height,ความยาวความยาวความยาว
length width hi,ความยาวความยาวสวัสดี
lethal,เป็นอันตรายถึงชีวิต
lexicographical,เกี่ยวกับพจนานุกรม
lexicographically,อย่างเกี่ยวกับพจนานุกรม
liar,คนโกหก
liberty,เสรีภาพ
limb,แขนขา
lineage,เชื้อสาย
literacy,การรู้หนังสือ
literature,วรรณกรรม
look up to,มองหา
lore,ตำนาน
lots,จำนวนมาก
lounge,เลานจ์
lower bound,ขอบเขตล่าง
lucid,ชัดเจน
lullaby,เพลงกล่อมเด็ก
lust,ความต้องการ
mad,โกรธ
magnificent,งดงาม
maintenance,การซ่อมบำรุง
maintene,การซ่อมบำรุง
majestic,สง่างาม
manipulate,จัดการ
manipyl,การจัดการ
manure,ปุ๋ยคอก
martial,เกี่ยวกับการต่อสู้
massage,นวด
material,วัสดุ
mathematics,คณิตศาสตร์
mature,เป็นผู้ใหญ่
median,ค่ามัธยฐาน
mediocrity,คนธรรมดา
medium,ปานกลาง
menetized,ที่ได้ถูกทำให้หมดจด
merchandise,สินค้า
mess,ความยุ่งเหยิง
methodology,วิธีการ
metronome,เครื่องเมตรอนอม
migrate,โยกย้าย
minority,ชนกลุ่มน้อย
misconceptions,ความเข้าใจผิด
miseremember,ความทุกข์ยาก
misremember,ผู้ถือหลัก
mission,ภารกิจ
mock,เยาะเย้ย
moderate,ปานกลาง
moisture,ความชื้น
mold,แม่พิมพ์
monetize,สร้างรายได้
monthly,รายเดือน
more,มากกว่า
move,เคลื่อนไหว
myth,ตำนาน
narrative,เรื่องเล่า
narrow,แคบ
nasty,น่ารังเกียจ
native,พื้นเมือง
naughty,ซน
needles,เข็ม
neglect,ละเลย
network,เครือข่าย
nevertheless,แต่ถึงอย่างไร
noblewoman,หญิงขุนนาง
nor,ก็ไม่เช่นกัน
nostaldl,ความผิดปกติ
nostalgia,ความคิดถึง
nostalgic,เกี่ยวกับความคิดถึง
not up scratch,ไม่ต้องเกา
novecommunity,ชุมชน
nuisance,ความรำคาญ
nut,ถั่ว
oath,คำสาบาน
obey,เชื่อฟัง
objective,วัตถุประสงค์
obstacle,อุปสรรค
occur,เกิดขึ้น
odor,กลิ่น
offensive security,ความปลอดภัยที่น่ารังเกียจ
operator,ผู้ดำเนินการ
optemetricst,นักตรวจสายตา
optimistic,มองโลกในแง่ดี
optimized,ที่ปรับให้เหมาะสม
optometrist,นักตรวจสายตา
oral,ปากเปล่า
orbit,วงโคจร
ordinary,สามัญ
organize a camp,จัดค่าย
orient,ทิศทาง
origin,ต้นทาง
originated,มีต้นกำเนิด
orphanage,สถานเลี้ยงเด็กกำพร้า
outward,ออกไปข้างนอก
overall band,วงดนตรีโดยรวม
overlooked,ถูกมองข้าม
overwhelming,ล้นหลาม
owe,เป็นหนี้
pace,ก้าว
paddle,พายเรือ
pain,ความเจ็บปวด
panel,แผง
parallel,ขนาน
paralysis,อัมพาต
parenthesis,วงเล็บ
part,ส่วนหนึ่ง
participate,เข้าร่วม
particular,โดยเฉพาะ
patronage,การอุปถัมภ์
payment,การชำระเงิน
penatary,เพนทาร์
penitentiary,การคุมขัง
pentester,เนยแข็ง
perceive,รับรู้
period,ระยะเวลา
permanent,ถาวร
perservence,ทำให้
persist,คงอยู่
persistent,ดื้อดึง
personal,ส่วนตัว
petition,คำร้อง
phase,ขั้นตอน
phenomenon,ปรากฏการณ์
philosophy,ปรัชญา
phobia,ความหวาดกลัว
phycologi,จิตวิทยา
pile,กอง
pill,ยา
pioneer,ผู้บุกเบิก
pioneering,การบุกเบิก
pitiful,น่าสงสาร
pity,สงสาร
plain,ธรรมดา
platform,แพลตฟอร์ม
platonic,อย่างสงบ
platypus,ตุ่นปากเป็ด
plot,พล็อต
poem,บทกวี
poetic,บทกวี
poetry,บทกวี
poor,ยากจน
poorly,ไม่ดี
porridge,โจ๊ก
portion,ส่วน
possessed,ที่ได้ถูกครอบครอง
postpone,เลื่อน
pouch,กระเป๋า
pouch egg,ไข่ลวก
pound,ปอนด์
poverty,ความยากจน
practical section,ภาคปฏิบัติ
president,ประธาน
previous,ก่อนหน้า
principal,อาจารย์ใหญ่
print,พิมพ์
prior,ก่อน
prior to,ก่อน
priority,ลำดับความสำคัญ
pro,มืออาชีพ
procastination,การผัดวันประกันพรุ่ง
procedures,ขั้นตอน
process,กระบวนการ
processes,กระบวนการ
prodigy,อัจฉริยะ
profoundsdf,ลึกซึ้ง
progress,ความคืบหน้า
protagonist,ตัวเอก
prototype,ต้นแบบ
proud,ภูมิใจ
provide,จัดเตรียม
province,จังหวัด
provoke,ยั่ว
pseudo,เทียม
pseudo code,รหัสเทียม
psychology,จิตวิทยา
punctuation,วรรคตอน
purpose,วัตถุประสงค์
purse,กระเป๋าเงิน
query,สอบถาม
quota,โควต้า
quote,อ้าง
raise one arm,ยกแขนข้างหนึ่ง
raised third arm,ยกแขนที่สาม
rank,ติดอันดับ
real,จริง
really update,อัปเดตจริงๆ
receipt,ใบเสร็จ
receptive,เปิดกว้าง
recomputation,การคำนวณใหม่
redundant,ซ้ำซ้อน
refute,หักล้าง
region,ภูมิภาค
register,ลงทะเบียน
regular,ปกติ
reign,รัชกาล
reinforcement,การเสริมกำลัง
relative,ญาติ
relevant,ที่เกี่ยวข้อง
rely,พึ่งพา
rely on,พึ่งพา
remedy,วิธีการรักษา
remote,ระยะไกล
repititive,ซ้ำ
representative,ตัวแทน
reserve,จอง
resident,ผู้อยู่อาศัย
resign,ลาออก
resin,เรซิน
respectively,ตามลำดับ
restrict,จำกัด
reunite,รวมตัวกันใหม่
review,ทบทวน
revolution,การปฎิวัติ
revolutionary,การปฏิวัติ
revolutionize,ปฏิวัติ
rhyme and rhythm,สัมผัสและจังหวะ
ritual,พิธีกรรม
robustness,ความทนทาน
roundabout,วงเวียน
rumors,ข่าวลือ
run out,หมด
rust,สนิม
rustle,ทำให้เกิดเสียงกรอบ
rut,ร่อง
sacrificed,เสียสละ
sad,เศร้า
salary,เงินเดือน
sarcastic,ประชดประชัน
satisfied,พอใจ
savory,เผ็ด
scenario,สถานการณ์
scene,ฉาก
scenery,ทิวทัศน์
scheme,แผนการ
schizophrenia,โรคจิตเภท
score,คะแนน
scoring,การให้คะแนน
scrap,เศษ
sculpture,ประติมากรรม
seal,ผนึก
sealed,ที่ปิดผนึก
sealing,การปิดผนึก
seals,แมวน้ำ
segmatatio n,การแบ่งส่วน
segment,ส่วน
seldom,ไม่ค่อย
self discipline,วินัย
senior,อาวุโส
sense,ความรู้สึก
separate,แยก
sequence,ลำดับ
session,การประชุม
shatter,ป่นปี้
shrewd,ฉลาด
shrink,หด
shrinking,การหดตัว
sign,เข้าสู่ระบบ
sill,ธรณีประตู
silly,โง่
simplify,ทำให้ง่ายขึ้น
slaughter,ฆ่า
slchizophrenia,โรคจิตเภท
sleek,เงางาม
sleepy,ง่วงนอน
slip,ลื่น
sole,แต่เพียงผู้เดียว
solid,แข็ง
sore,เจ็บ
space,ช่องว่าง
spare,สำรอง
spark,จุดประกาย
spectacular,งดงาม
spilt,รั่วไหล
splash,สาด
split,แยก
spontaneity,ความเป็นธรรมชาติ
staff,พนักงาน
stall,แผงลอย
steady,สม่ำเสมอ
steam,ไอน้ำ
steep,สูงชัน
stenotypq,กลิ่นเหม็น
streak,แนว
stream,ลำธาร
streategize,ทำให้เป็นรอย
strike,โจมตี
stroke,จังหวะ
struggle,การต่อสู้
stubborn,ดื้อดึง
study well,เรียนดี
subdistrict,ผู้พิพากษา
succeed,สำเร็จ
success,ความสำเร็จ
succinct,สั้น
suffer,ทุกข์ทรมาน
sufficient,เพียงพอ
suit,สูท
supposed,ที่ควร
suspect,สงสัย
suspended,ถูกระงับ
suspicious,สงสัย
sustainable,ที่ยั่งยืน
sway,แกว่ง
swear,สาบาน
swelling,บวม
switch,สวิตช์
switched,ที่ได้ถูกสลับ
sympathize,เห็นอกเห็นใจ
synthaaic,การสังเคราะห์
synthaic,เกี่ยวกับการสังเคราะห์
synthataic,เกี่ยวกับการสังเคราะห์
synthetaic,เกี่ยวกับการสังเคราะห์
tafa,รุ่งอรุณ
take a break,พัก
tampons,ผ้าอนามัยแบบสอด
tangle,พันกัน
tend,มีแนวโน้ม
tension,ความเครียด
term,ภาคเรียน
terms,คำศัพท์
therapist,นักบำบัดโรค
thesis,วิทยานิพนธ์
thick,หนา
thin,บาง
thousands,หลายพันคน
threshold,เกณฑ์
thrill,ความตื่นเต้น
throughout,ตลอดทั้ง
thus,ดังนั้น
tight,แน่น
tile,กระเบื้อง
tilted,เอียง
tired,เหนื่อย
to retreat,เพื่อล่าถอย
tolerant,ใจกว้าง
tolerate,ทนต่อ
toll,การโทร
tongue,ลิ้น
touchable,สัมผัสได้
towel,ผ้าขนหนู
traditional,แบบดั้งเดิม
tragedy,โศกนาฏกรรม
tragic,น่าเศร้า
trail,เส้นทาง
trailing,การล้ำหน้า
train,รถไฟ
transact,ทำธุรกรรม
translate,แปล
trauma,การบาดเจ็บ
traverse,การสำรวจ
tres,สาม
trial and error,การทดลองและข้อผิดพลาด
trilogy,ไตรภาค
trivial,เล็กน้อย
truncated,ที่ถูกตัดทอน
trust,เชื่อมั่น
try harder,พยายามให้มากขึ้น
twig,กิ่งไม้
twist,บิด
type,พิมพ์
typical,ทั่วไป
unauthorized,ไม่ได้รับอนุญาต
underatted,ที่ประเมินค่าต่ำกว่า
underrated,ที่ประเมินค่าต่ำกว่า
undisputed,ไม่มีปัญหา
unemplo,การว่างงาน
unfortunate,โชคร้าย
unit,หน่วย
unlovable,ไม่น่ารัก
up and down,ขึ้นและลง
urged,ซึ่งได้รับการสนับสนุน
urgent,ด่วน
urges,การเรียกร้อง
utensils,เครื่องใช้
utmost,ที่สุด
vaculiou,ที่ได้ถูกทิ้งร้าง
vagrant,คนพเนจร
vapor,ไอ
variabilitty,ความแปรปรวน
various,หลากหลาย
vasectomy,การทำหมัน
velocity,ความเร็ว
venture,กิจการร่วมค้า
verge,ใกล้
victim,เหยื่อ
violence,ความรุนแรง
virgin,บริสุทธิ์
vital,สำคัญยิ่ง
vivid,สดใส
vocal,เสียงร้อง
vocalous,เปล่งเสียง
volume,ปริมาณ
voracious,ไม่รู้จักพอ
vulnerability,ความอ่อนแอ
vulnerable,เปราะบาง
walkthrough,คำแนะนำ
wash out,ล้างออก
wax,ขี้ผึ้ง
weakness,ความอ่อนแอ
well being,ความเป็นอยู่ที่ดี
whether,ไม่ว่า
width,ความกว้าง
wisdom,ภูมิปัญญา
wise,ฉลาด
withstand,ทนต่อ
witness,พยาน
won,วอน
wonderfully,อย่างน่าอัศจรรย์
word,คำ
workaholic,เกี่ยวกับคนบ้างาน
worried,กังวล
worth,คุณค่า
wrath,ความโกรธแค้น
yet,ยัง
yield,ผลผลิต